const data = {
  products: [
    {
      name: 'ابله',
      slug: 'idiot',
      category: 'رمان',
      image: './images/idiot.jpg',
      price: '219000',
      brand: 'چشمه',
      rating: 5,
      numReviews: 10,
      countInStock: 20,
      author: 'فیودور داستایوفسکی',
      translate: 'سروش حبیبی',
      description:
        'شاهکار «داستایوسکی» درباره «میشکین» -آخرین فرزند یک خاندان بزرگ ورشکسته - که پس از اقامتی طولانی در سوییس برای معالجه بیماری، به میهن خود باز می گردد.',
    },
    {
      name: 'ترس و لرز',
      category: 'فلسفه',
      slug: 'fear-and-trembling',
      image: './images/fear.jpg',
      price: '48000',
      brand: 'نی',
      rating: 5,
      numReviews: 10,
      countInStock: 20,
      author: 'سورن کیرکگور',
      translate: 'عبدالکریم رشیدیان',
      description:
        'کیرکگور ترس و لرز را بهترین کتاب خود می‌دانست؛ او می‌گفت این کتاب برای جاودانه‌کردن نام من کافی است. «دیالکتیک تغزلی» او، هنر او در وادارساختن ما به حس‌کردن خصلت‌های ویژه‌ی این قلمرو مذهب… هرگز چنین ژرف بر ما تأثیر ننهاده است، و نیز هرگز… روایتش تا این حد با شخصی‌ترین جدال‌هایش در پیوند نبوده است. اما همیشه نمی‌توان به‌آسانی اندیشه‌ی کیرکگور را در ورای اندیشه‌ی یوهانس دوسلنتیو… به تمامی به‌چنگ آورد. به گفته‌ی هیرش این دشوارترین اثر کیرکگور است که در آن بیش از هر اثر دیگر به هر وسیله‌ای در سرگردان‌کردن خواننده کوشیده است. ژان وال ',
    },
  ],
}
export default data
